[Killed] ConditionalExpression
core/adapters/secondaries/in-mermory-characters-repository.ts:74:69
     ];
   }
   getCharacter(name: ExistingCharacters, level: PossibleLevels, weaponProps: { name: string; level: PossibleLevels }): Character {
-    const characterStats = this.charactersStats.find((character) => character.name === name).levels[level];
+    const characterStats = this.charactersStats.find((character) => false).levels[level];
     const weapon = this.weaponsRepository.getWeapon(weaponProps.name, weaponProps.level);
     return new CharacterBuilder()

[Killed] EqualityOperator
core/adapters/secondaries/in-mermory-characters-repository.ts:74:69
     ];
   }
   getCharacter(name: ExistingCharacters, level: PossibleLevels, weaponProps: { name: string; level: PossibleLevels }): Character {
-    const characterStats = this.charactersStats.find((character) => character.name === name).levels[level];
+    const characterStats = this.charactersStats.find((character) => character.name !== name).levels[level];
     const weapon = this.weaponsRepository.getWeapon(weaponProps.name, weaponProps.level);
     return new CharacterBuilder()
