[Killed] BlockStatement
core/adapters/secondaries/in-mermory-weapons-repository.ts:15:17
 export class InMemoryWeaponsRepository implements WeaponsRepository {
   private readonly weaponsStats: WeaponStats[];
 
-  constructor() {
-    this.weaponsStats = [...allBows, ...allCatalysts, ...allClaymores, ...allPolearms, ...allSwords];
-  }
+  constructor() {}
   getWeapon(name: string, level: PossibleLevels): Weapon {
     const weaponStats = this.weaponsStats.find((weapon) => weapon.name === name);

[Killed] ConditionalExpression
core/adapters/secondaries/in-mermory-weapons-repository.ts:19:60
     this.weaponsStats = [...allBows, ...allCatalysts, ...allClaymores, ...allPolearms, ...allSwords];
   }
   getWeapon(name: string, level: PossibleLevels): Weapon {
-    const weaponStats = this.weaponsStats.find((weapon) => weapon.name === name);
+    const weaponStats = this.weaponsStats.find((weapon) => false);
     return { ...weaponStats.levels[level], type: weaponStats.type, name, level };
   }

[Killed] ArrowFunction
core/adapters/secondaries/in-mermory-weapons-repository.ts:19:48
     this.weaponsStats = [...allBows, ...allCatalysts, ...allClaymores, ...allPolearms, ...allSwords];
   }
   getWeapon(name: string, level: PossibleLevels): Weapon {
-    const weaponStats = this.weaponsStats.find((weapon) => weapon.name === name);
+    const weaponStats = this.weaponsStats.find(() => undefined);
     return { ...weaponStats.levels[level], type: weaponStats.type, name, level };
   }
