[Killed] ArrayDeclaration
core/domain/entities/artifact.ts:14:14
 
   protected readonly mainStatPossibleValues: { stats: Array<PossibleMainStatTypes>; values: number[] }[] = [
     {
-      stats: [
-        PossibleMainStats.percentAtk,
-        PossibleMainStats.percentHp,
-        PossibleMainStats.pyroDmg,
-        PossibleMainStats.dendroDmg,
-        PossibleMainStats.electroDmg,
-        PossibleMainStats.anemoDmg,
-        PossibleMainStats.cryoDmg,
-        PossibleMainStats.geoDmg,
-      ],
+      stats: [],
       values: [7, 9, 11, 12.9, 14.9, 16.9, 18.9, 20.9, 22.8, 24, 26.8, 28.8, 30.8, 32.8, 34.7, 36.7, 38.7, 40.7, 42.7, 44.6, 46.6],
     },

[Killed] ArrayDeclaration
core/domain/entities/artifact.ts:32:15
     },
     {
       stats: [PossibleMainStats.elementalMastery],
-      values: [28, 36, 44, 52, 60, 68, 76, 84, 91, 99, 107, 115, 123, 131, 139, 147, 155, 163, 171, 179, 187],
+      values: [],
     },
     {

[Killed] ArrayDeclaration
core/domain/entities/artifact.ts:35:14
       values: [28, 36, 44, 52, 60, 68, 76, 84, 91, 99, 107, 115, 123, 131, 139, 147, 155, 163, 171, 179, 187],
     },
     {
-      stats: [PossibleMainStats.energyRecharge],
+      stats: [],
       values: [7.8, 10, 12.2, 14.4, 16.6, 18.8, 21, 23.2, 25.4, 27.6, 29.8, 32, 34.2, 36.4, 38.6, 40.8, 43, 45.2, 47.4, 49.6, 51.8],
     },

[Survived] ArrayDeclaration
core/domain/entities/artifact.ts:44:15
     },
     {
       stats: [PossibleMainStats.critDmg],
-      values: [9.3, 11.9, 14.6, 17.2, 19.9, 22.5, 25.5, 27.8, 30.5, 33.1, 35.8, 38.4, 41.1, 43.7, 46.3, 49, 51.6, 54.3, 56.9, 59.6, 62.2],
+      values: [],
     },
     {

[Killed] BlockStatement
core/domain/entities/artifact.ts:60:120
     },
   ];
 
-  constructor(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: PossibleMainStatTypes) {
-    if (Object.keys(subStats).length < 3) {
-      throw new Error('an artifact can not have less than 3 substats');
-    }
-    if (level > 3 && Object.keys(subStats).length === 3) {
-      throw new Error('an artifact with level higher than 3 must have 4 substats');
-    }
-    if (Object.keys(subStats).length > 4) {
-      throw new Error('an artifact can not have more than 4 substats');
-    }
-
-    if (!mainStatType) {
-      throw new Error('main stat is mandatory');
-    }
-
-    if (Object.keys(subStats).find((subStat) => subStat === mainStatType)) {
-      throw new Error('main stat can not be the same as one of the substats');
-    }
-
-    this.id = id;
-    this.set = set;
-    this.level = level;
-    this.subStats = subStats;
-    this.setMainStat(mainStatType);
-  }
+  constructor(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: PossibleMainStatTypes) {}
 
   public matchFilters(minLevel = 0, focusStats?: Array<PossibleSubStats | PossibleMainStats>): boolean {

[Killed] EqualityOperator
core/domain/entities/artifact.ts:61:9
   ];
 
   constructor(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: PossibleMainStatTypes) {
-    if (Object.keys(subStats).length < 3) {
+    if (Object.keys(subStats).length >= 3) {
       throw new Error('an artifact can not have less than 3 substats');
     }

[Killed] ConditionalExpression
core/domain/entities/artifact.ts:61:9
   ];
 
   constructor(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: PossibleMainStatTypes) {
-    if (Object.keys(subStats).length < 3) {
+    if (false) {
       throw new Error('an artifact can not have less than 3 substats');
     }

[Killed] StringLiteral
core/domain/entities/artifact.ts:62:23
 
   constructor(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: PossibleMainStatTypes) {
     if (Object.keys(subStats).length < 3) {
-      throw new Error('an artifact can not have less than 3 substats');
+      throw new Error("");
     }
     if (level > 3 && Object.keys(subStats).length === 3) {

[Killed] BlockStatement
core/domain/entities/artifact.ts:64:58
     if (Object.keys(subStats).length < 3) {
       throw new Error('an artifact can not have less than 3 substats');
     }
-    if (level > 3 && Object.keys(subStats).length === 3) {
-      throw new Error('an artifact with level higher than 3 must have 4 substats');
-    }
+    if (level > 3 && Object.keys(subStats).length === 3) {}
     if (Object.keys(subStats).length > 4) {
       throw new Error('an artifact can not have more than 4 substats');

[Killed] EqualityOperator
core/domain/entities/artifact.ts:64:22
     if (Object.keys(subStats).length < 3) {
       throw new Error('an artifact can not have less than 3 substats');
     }
-    if (level > 3 && Object.keys(subStats).length === 3) {
+    if (level > 3 && Object.keys(subStats).length !== 3) {
       throw new Error('an artifact with level higher than 3 must have 4 substats');
     }

[Killed] EqualityOperator
core/domain/entities/artifact.ts:67:9
     if (level > 3 && Object.keys(subStats).length === 3) {
       throw new Error('an artifact with level higher than 3 must have 4 substats');
     }
-    if (Object.keys(subStats).length > 4) {
+    if (Object.keys(subStats).length <= 4) {
       throw new Error('an artifact can not have more than 4 substats');
     }

[Killed] BlockStatement
core/domain/entities/artifact.ts:67:43
     if (level > 3 && Object.keys(subStats).length === 3) {
       throw new Error('an artifact with level higher than 3 must have 4 substats');
     }
-    if (Object.keys(subStats).length > 4) {
-      throw new Error('an artifact can not have more than 4 substats');
-    }
+    if (Object.keys(subStats).length > 4) {}
 
     if (!mainStatType) {

[Killed] StringLiteral
core/domain/entities/artifact.ts:68:23
       throw new Error('an artifact with level higher than 3 must have 4 substats');
     }
     if (Object.keys(subStats).length > 4) {
-      throw new Error('an artifact can not have more than 4 substats');
+      throw new Error("");
     }
 

[Killed] BooleanLiteral
core/domain/entities/artifact.ts:71:9
       throw new Error('an artifact can not have more than 4 substats');
     }
 
-    if (!mainStatType) {
+    if (mainStatType) {
       throw new Error('main stat is mandatory');
     }

[Killed] BlockStatement
core/domain/entities/artifact.ts:71:24
       throw new Error('an artifact can not have more than 4 substats');
     }
 
-    if (!mainStatType) {
-      throw new Error('main stat is mandatory');
-    }
+    if (!mainStatType) {}
 
     if (Object.keys(subStats).find((subStat) => subStat === mainStatType)) {

[Killed] BlockStatement
core/domain/entities/artifact.ts:75:76
       throw new Error('main stat is mandatory');
     }
 
-    if (Object.keys(subStats).find((subStat) => subStat === mainStatType)) {
-      throw new Error('main stat can not be the same as one of the substats');
-    }
+    if (Object.keys(subStats).find((subStat) => subStat === mainStatType)) {}
 
     this.id = id;

[Killed] EqualityOperator
core/domain/entities/artifact.ts:75:49
       throw new Error('main stat is mandatory');
     }
 
-    if (Object.keys(subStats).find((subStat) => subStat === mainStatType)) {
+    if (Object.keys(subStats).find((subStat) => subStat !== mainStatType)) {
       throw new Error('main stat can not be the same as one of the substats');
     }

[Killed] EqualityOperator
core/domain/entities/artifact.ts:87:12
   }
 
   public matchFilters(minLevel = 0, focusStats?: Array<PossibleSubStats | PossibleMainStats>): boolean {
-    return this.level >= minLevel && this.filterByFocusStats(focusStats);
+    return this.level > minLevel && this.filterByFocusStats(focusStats);
   }
 

[Killed] LogicalOperator
core/domain/entities/artifact.ts:87:12
   }
 
   public matchFilters(minLevel = 0, focusStats?: Array<PossibleSubStats | PossibleMainStats>): boolean {
-    return this.level >= minLevel && this.filterByFocusStats(focusStats);
+    return this.level >= minLevel || this.filterByFocusStats(focusStats);
   }
 

[Killed] ConditionalExpression
core/domain/entities/artifact.ts:92:7
 
   private filterByFocusStats(focusStats: Array<PossibleSubStats | PossibleMainStats>): boolean {
     return (
-      !focusStats ||
-      !!Object.keys({ ...this.subStats, ...this.mainStat }).find((artifactStats: PossibleSubStats | PossibleMainStats) =>
-        focusStats.includes(artifactStats),
-      )
+      true
     );
   }

[Killed] LogicalOperator
core/domain/entities/artifact.ts:92:7
 
   private filterByFocusStats(focusStats: Array<PossibleSubStats | PossibleMainStats>): boolean {
     return (
-      !focusStats ||
-      !!Object.keys({ ...this.subStats, ...this.mainStat }).find((artifactStats: PossibleSubStats | PossibleMainStats) =>
-        focusStats.includes(artifactStats),
-      )
+      !focusStats && !!Object.keys({ ...this.subStats,
+  ...this.mainStat
+}).find((artifactStats: PossibleSubStats | PossibleMainStats) => focusStats.includes(artifactStats))
     );
   }

[Killed] BooleanLiteral
core/domain/entities/artifact.ts:93:8
   private filterByFocusStats(focusStats: Array<PossibleSubStats | PossibleMainStats>): boolean {
     return (
       !focusStats ||
-      !!Object.keys({ ...this.subStats, ...this.mainStat }).find((artifactStats: PossibleSubStats | PossibleMainStats) =>
-        focusStats.includes(artifactStats),
-      )
+      !Object.keys({ ...this.subStats,
+  ...this.mainStat
+}).find((artifactStats: PossibleSubStats | PossibleMainStats) => focusStats.includes(artifactStats))
     );
   }

[Killed] ArrowFunction
core/domain/entities/artifact.ts:93:66
   private filterByFocusStats(focusStats: Array<PossibleSubStats | PossibleMainStats>): boolean {
     return (
       !focusStats ||
-      !!Object.keys({ ...this.subStats, ...this.mainStat }).find((artifactStats: PossibleSubStats | PossibleMainStats) =>
-        focusStats.includes(artifactStats),
+      !!Object.keys({ ...this.subStats, ...this.mainStat }).find(() => undefined,
       )
     );

[Killed] BlockStatement
core/domain/entities/artifact.ts:99:66
     );
   }
 
-  private setMainStat(mainStatType: PossibleMainStatTypes): void {
-    const mainStatValue: number = this.mainStatPossibleValues.find((mainStatPossibleValue) =>
-      mainStatPossibleValue.stats.includes(mainStatType),
-    ).values[this.level];
-    this.mainStat = { [mainStatType]: mainStatValue };
-  }
+  private setMainStat(mainStatType: PossibleMainStatTypes): void {}
 }
 

[Killed] ArrowFunction
core/domain/entities/artifact.ts:100:68
   }
 
   private setMainStat(mainStatType: PossibleMainStatTypes): void {
-    const mainStatValue: number = this.mainStatPossibleValues.find((mainStatPossibleValue) =>
-      mainStatPossibleValue.stats.includes(mainStatType),
+    const mainStatValue: number = this.mainStatPossibleValues.find(() => undefined,
     ).values[this.level];
     this.mainStat = { [mainStatType]: mainStatValue };
