[Killed] ConditionalExpression
core/domain/entities/circlet-artifact.ts:27:33
     focusStats?: Array<PossibleSubStats | PossibleMainStats>,
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
-    const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
+    const mainStatMatchFilter = true;
     return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
   }

[Killed] EqualityOperator
core/domain/entities/circlet-artifact.ts:27:46
     focusStats?: Array<PossibleSubStats | PossibleMainStats>,
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
-    const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
+    const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] !== mainStat;
     return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
   }

[Killed] ConditionalExpression
core/domain/entities/circlet-artifact.ts:28:12
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
     const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
-    return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
+    return false;
   }
 }

[Killed] ConditionalExpression
core/domain/entities/circlet-artifact.ts:28:12
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
     const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
-    return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
+    return true;
   }
 }
