[Killed] BooleanLiteral
core/domain/entities/goblet-artifact.ts:32:33
     focusStats?: Array<PossibleSubStats | PossibleMainStats>,
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
-    const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
+    const mainStatMatchFilter = mainStat || Object.keys(this.mainStat)[0] === mainStat;
     return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
   }

[Killed] LogicalOperator
core/domain/entities/goblet-artifact.ts:33:12
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
     const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
-    return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
+    return mainStatMatchFilter || this.matchFilters(minLevel, focusAndMainStats);
   }
 }
