[Killed] ConditionalExpression
core/domain/entities/sands-artifact.ts:26:46
     focusStats?: Array<PossibleSubStats | PossibleMainStats>,
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
-    const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
+    const mainStatMatchFilter = !mainStat || false;
     return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
   }

[Killed] LogicalOperator
core/domain/entities/sands-artifact.ts:26:33
     focusStats?: Array<PossibleSubStats | PossibleMainStats>,
   ): boolean {
     const focusAndMainStats = focusStats ? [...focusStats, mainStat] : focusStats;
-    const mainStatMatchFilter = !mainStat || Object.keys(this.mainStat)[0] === mainStat;
+    const mainStatMatchFilter = !mainStat && Object.keys(this.mainStat)[0] === mainStat;
     return mainStatMatchFilter && this.matchFilters(minLevel, focusAndMainStats);
   }
