[Killed] ObjectLiteral
core/domain/models/character-builder.ts:49:14
       name: this.name,
       level: this.level,
       weapon: this.weapon,
-      stats: { ...this.commonBaseStats, ...this.stats },
+      stats: {},
       bonusStat: this.bonusStat,
     };
