[Killed] BlockStatement
src/core/usescases/artifacts-handler.ts:13:102
 export class ArtifactsHandler {
   private artifacts: Artifact[] = [];
 
-  public addFlowerArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number): void {
-    this.artifacts = [...this.artifacts, new FlowerArtifact(id, set, subStats, level)];
-  }
+  public addFlowerArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number): void {}
 
   public addPlumeArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number): void {

[Killed] ArrayDeclaration
src/core/usescases/artifacts-handler.ts:14:22
   private artifacts: Artifact[] = [];
 
   public addFlowerArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number): void {
-    this.artifacts = [...this.artifacts, new FlowerArtifact(id, set, subStats, level)];
+    this.artifacts = [];
   }
 

[Killed] BlockStatement
src/core/usescases/artifacts-handler.ts:17:101
     this.artifacts = [...this.artifacts, new FlowerArtifact(id, set, subStats, level)];
   }
 
-  public addPlumeArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number): void {
-    this.artifacts = [...this.artifacts, new PlumeArtifact(id, set, subStats, level)];
-  }
+  public addPlumeArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number): void {}
 
   public addSandsArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: SandsMainStatType): void {

[Killed] BlockStatement
src/core/usescases/artifacts-handler.ts:21:134
     this.artifacts = [...this.artifacts, new PlumeArtifact(id, set, subStats, level)];
   }
 
-  public addSandsArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: SandsMainStatType): void {
-    this.artifacts = [...this.artifacts, new SandsArtifact(id, set, subStats, level, mainStatType)];
-  }
+  public addSandsArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: SandsMainStatType): void {}
 
   public addGobletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: GobletMainStatType): void {

[Killed] BlockStatement
src/core/usescases/artifacts-handler.ts:25:136
     this.artifacts = [...this.artifacts, new SandsArtifact(id, set, subStats, level, mainStatType)];
   }
 
-  public addGobletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: GobletMainStatType): void {
-    this.artifacts = [...this.artifacts, new GobletArtifact(id, set, subStats, level, mainStatType)];
-  }
+  public addGobletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: GobletMainStatType): void {}
 
   public addCircletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: CircletMainStatType): void {

[Killed] ArrayDeclaration
src/core/usescases/artifacts-handler.ts:26:22
   }
 
   public addGobletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: GobletMainStatType): void {
-    this.artifacts = [...this.artifacts, new GobletArtifact(id, set, subStats, level, mainStatType)];
+    this.artifacts = [];
   }
 

[Killed] BlockStatement
src/core/usescases/artifacts-handler.ts:29:138
     this.artifacts = [...this.artifacts, new GobletArtifact(id, set, subStats, level, mainStatType)];
   }
 
-  public addCircletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: CircletMainStatType): void {
-    this.artifacts = [...this.artifacts, new CircletArtifact(id, set, subStats, level, mainStatType)];
-  }
+  public addCircletArtifact(id: string, set: SetNames, subStats: SubStatsValues, level: number, mainStatType: CircletMainStatType): void {}
 
   public getAll(): Artifact[] {
