[Killed] BlockStatement
src/core/usescases/build-optimizer.ts:61:5
     sandsArtifacts: SandsArtifact[] = [],
     gobletArtifacts: GobletArtifact[] = [],
     circletArtifacts: CircletArtifact[] = [],
-  ) {
-    this.flowerArtifacts = flowerArtifacts;
-    this.plumeArtifacts = plumeArtifacts;
-    this.sandsArtifacts = sandsArtifacts;
-    this.gobletArtifacts = gobletArtifacts;
-    this.circletArtifacts = circletArtifacts;
-  }
+  ) {}
 
   public computeBuildsStats(

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:80:72
     const allBuilds: CharacterStatsValues[] = [];
     const allArtifacts = [flowerArtifacts, plumeArtifacts, sandsArtifacts, gobletArtifacts, circletArtifacts];
     const weapon = character.weapon;
-    const baseStats: CharacterStatsValues = { ...character.stats, atk: character.stats.atk + weapon.atk };
+    const baseStats: CharacterStatsValues = { ...character.stats, atk: character.stats.atk - weapon.atk };
     const characterBonusKey = character.bonusStat ? Object.keys(character.bonusStat)[0] : character.bonusStat;
     const characterBonusStat: MainStatsValues =

[Killed] ObjectLiteral
src/core/usescases/build-optimizer.ts:80:45
     const allBuilds: CharacterStatsValues[] = [];
     const allArtifacts = [flowerArtifacts, plumeArtifacts, sandsArtifacts, gobletArtifacts, circletArtifacts];
     const weapon = character.weapon;
-    const baseStats: CharacterStatsValues = { ...character.stats, atk: character.stats.atk + weapon.atk };
+    const baseStats: CharacterStatsValues = {};
     const characterBonusKey = character.bonusStat ? Object.keys(character.bonusStat)[0] : character.bonusStat;
     const characterBonusStat: MainStatsValues =

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:86:17
       characterBonusKey === Object.keys(weapon.bonusStat)[0]
         ? { [characterBonusKey]: this.addStats([character.bonusStat[characterBonusKey], weapon.bonusStat[characterBonusKey]]) }
         : { ...character.bonusStat, ...weapon.bonusStat };
-    const max = allArtifacts.length - 1;
+    const max = allArtifacts.length + 1;
 
     const addArtifactsToCompute = (artifacts: Artifact[], i: number) => {

[Killed] BlockStatement
src/core/usescases/build-optimizer.ts:88:73
         : { ...character.bonusStat, ...weapon.bonusStat };
     const max = allArtifacts.length - 1;
 
-    const addArtifactsToCompute = (artifacts: Artifact[], i: number) => {
-      allArtifacts[i].forEach((artifact: Artifact) => {
-        const artifactsToCompute = [...artifacts];
-        artifactsToCompute.push(artifact);
-        if (i === max) {
-          const artifactsStats = this.computeArtifactsStats(artifactsToCompute);
-          const setsStats = this.computeSetsStats(artifactsToCompute);
-          allBuilds.push(this.reduceToBuildStats({ ...baseStats }, characterBonusStat, artifactsStats, setsStats));
-          return;
-        }
-        addArtifactsToCompute(artifactsToCompute, i + 1);
-      });
-    };
+    const addArtifactsToCompute = (artifacts: Artifact[], i: number) => {};
 
     addArtifactsToCompute([], 0);

[Killed] BlockStatement
src/core/usescases/build-optimizer.ts:89:55
     const max = allArtifacts.length - 1;
 
     const addArtifactsToCompute = (artifacts: Artifact[], i: number) => {
-      allArtifacts[i].forEach((artifact: Artifact) => {
-        const artifactsToCompute = [...artifacts];
-        artifactsToCompute.push(artifact);
-        if (i === max) {
-          const artifactsStats = this.computeArtifactsStats(artifactsToCompute);
-          const setsStats = this.computeSetsStats(artifactsToCompute);
-          allBuilds.push(this.reduceToBuildStats({ ...baseStats }, characterBonusStat, artifactsStats, setsStats));
-          return;
-        }
-        addArtifactsToCompute(artifactsToCompute, i + 1);
-      });
+      allArtifacts[i].forEach((artifact: Artifact) => {});
     };
 

[Killed] ArrayDeclaration
src/core/usescases/build-optimizer.ts:90:36
 
     const addArtifactsToCompute = (artifacts: Artifact[], i: number) => {
       allArtifacts[i].forEach((artifact: Artifact) => {
-        const artifactsToCompute = [...artifacts];
+        const artifactsToCompute = [];
         artifactsToCompute.push(artifact);
         if (i === max) {

[Killed] EqualityOperator
src/core/usescases/build-optimizer.ts:92:13
       allArtifacts[i].forEach((artifact: Artifact) => {
         const artifactsToCompute = [...artifacts];
         artifactsToCompute.push(artifact);
-        if (i === max) {
+        if (i !== max) {
           const artifactsStats = this.computeArtifactsStats(artifactsToCompute);
           const setsStats = this.computeSetsStats(artifactsToCompute);

[Killed] ConditionalExpression
src/core/usescases/build-optimizer.ts:92:13
       allArtifacts[i].forEach((artifact: Artifact) => {
         const artifactsToCompute = [...artifacts];
         artifactsToCompute.push(artifact);
-        if (i === max) {
+        if (true) {
           const artifactsStats = this.computeArtifactsStats(artifactsToCompute);
           const setsStats = this.computeSetsStats(artifactsToCompute);

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:98:51
           allBuilds.push(this.reduceToBuildStats({ ...baseStats }, characterBonusStat, artifactsStats, setsStats));
           return;
         }
-        addArtifactsToCompute(artifactsToCompute, i + 1);
+        addArtifactsToCompute(artifactsToCompute, i - 1);
       });
     };

[Killed] BlockStatement
src/core/usescases/build-optimizer.ts:110:11
     mainStats?: { sandsMain?: SandsMainStatType; gobletMain?: GobletMainStatType; circletMain?: CircletMainStatType },
     minLevel?: number,
     focusStats?: Array<PossibleSubStats | PossibleMainStats>,
-  ): void {
-    const { sandsMain, gobletMain, circletMain } = mainStats ? mainStats : { sandsMain: null, gobletMain: null, circletMain: null };
-
-    this.filteredFlowerArtifacts = this.flowerArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
-    this.filteredPlumeArtifacts = this.plumeArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
-    this.filteredSandsArtifacts = this.sandsArtifacts.filter((artifact) => artifact.matchFiltersWithMain(sandsMain, minLevel, focusStats));
-    this.filteredGobletArtifacts = this.gobletArtifacts.filter((artifact) =>
-      artifact.matchFiltersWithMain(gobletMain, minLevel, focusStats),
-    );
-    this.filteredCircletArtifacts = this.circletArtifacts.filter((artifact) =>
-      artifact.matchFiltersWithMain(circletMain, minLevel, focusStats),
-    );
-  }
+  ): void {}
 
   public getPossibleBuilds(): number {

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:113:64
   ): void {
     const { sandsMain, gobletMain, circletMain } = mainStats ? mainStats : { sandsMain: null, gobletMain: null, circletMain: null };
 
-    this.filteredFlowerArtifacts = this.flowerArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
+    this.filteredFlowerArtifacts = this.flowerArtifacts.filter(() => undefined);
     this.filteredPlumeArtifacts = this.plumeArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
     this.filteredSandsArtifacts = this.sandsArtifacts.filter((artifact) => artifact.matchFiltersWithMain(sandsMain, minLevel, focusStats));

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:114:62
     const { sandsMain, gobletMain, circletMain } = mainStats ? mainStats : { sandsMain: null, gobletMain: null, circletMain: null };
 
     this.filteredFlowerArtifacts = this.flowerArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
-    this.filteredPlumeArtifacts = this.plumeArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
+    this.filteredPlumeArtifacts = this.plumeArtifacts.filter(() => undefined);
     this.filteredSandsArtifacts = this.sandsArtifacts.filter((artifact) => artifact.matchFiltersWithMain(sandsMain, minLevel, focusStats));
     this.filteredGobletArtifacts = this.gobletArtifacts.filter((artifact) =>

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:115:62
 
     this.filteredFlowerArtifacts = this.flowerArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
     this.filteredPlumeArtifacts = this.plumeArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
-    this.filteredSandsArtifacts = this.sandsArtifacts.filter((artifact) => artifact.matchFiltersWithMain(sandsMain, minLevel, focusStats));
+    this.filteredSandsArtifacts = this.sandsArtifacts.filter(() => undefined);
     this.filteredGobletArtifacts = this.gobletArtifacts.filter((artifact) =>
       artifact.matchFiltersWithMain(gobletMain, minLevel, focusStats),

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:116:64
     this.filteredFlowerArtifacts = this.flowerArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
     this.filteredPlumeArtifacts = this.plumeArtifacts.filter((artifact) => artifact.matchFilters(minLevel, focusStats));
     this.filteredSandsArtifacts = this.sandsArtifacts.filter((artifact) => artifact.matchFiltersWithMain(sandsMain, minLevel, focusStats));
-    this.filteredGobletArtifacts = this.gobletArtifacts.filter((artifact) =>
-      artifact.matchFiltersWithMain(gobletMain, minLevel, focusStats),
+    this.filteredGobletArtifacts = this.gobletArtifacts.filter(() => undefined,
     );
     this.filteredCircletArtifacts = this.circletArtifacts.filter((artifact) =>

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:119:66
     this.filteredGobletArtifacts = this.gobletArtifacts.filter((artifact) =>
       artifact.matchFiltersWithMain(gobletMain, minLevel, focusStats),
     );
-    this.filteredCircletArtifacts = this.circletArtifacts.filter((artifact) =>
-      artifact.matchFiltersWithMain(circletMain, minLevel, focusStats),
+    this.filteredCircletArtifacts = this.circletArtifacts.filter(() => undefined,
     );
   }

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:126:7
 
   public getPossibleBuilds(): number {
     return (
-      this.filteredFlowerArtifacts.length *
-      this.filteredPlumeArtifacts.length *
-      this.filteredSandsArtifacts.length *
-      this.filteredGobletArtifacts.length *
-      this.filteredCircletArtifacts.length
+      this.filteredFlowerArtifacts.length * this.filteredPlumeArtifacts.length * this.filteredSandsArtifacts.length * this.filteredGobletArtifacts.length / this.filteredCircletArtifacts.length
     );
   }

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:126:7
 
   public getPossibleBuilds(): number {
     return (
-      this.filteredFlowerArtifacts.length *
-      this.filteredPlumeArtifacts.length *
-      this.filteredSandsArtifacts.length *
+      this.filteredFlowerArtifacts.length * this.filteredPlumeArtifacts.length / this.filteredSandsArtifacts.length *
       this.filteredGobletArtifacts.length *
       this.filteredCircletArtifacts.length

[Killed] BlockStatement
src/core/usescases/build-optimizer.ts:138:80
     return artifacts.reduce((buildStats, artifact: Artifact) => {
       const mainStatKey: PossibleMainStats = Object.keys(artifact.mainStat)[0] as PossibleMainStats;
       buildStats[mainStatKey] = this.addStats([buildStats[mainStatKey], artifact.mainStat[mainStatKey]]);
-      Object.keys(artifact.subStats).forEach((subStatKey: PossibleSubStats) => {
-        buildStats[subStatKey] = this.addStats([buildStats[subStatKey], artifact.subStats[subStatKey]]);
-      });
+      Object.keys(artifact.subStats).forEach((subStatKey: PossibleSubStats) => {});
 
       return buildStats;

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:148:65
 
   private computeSetsStats(artifacts: Artifact[]): SetStatsValues {
     const buildSets: Partial<{ [key in SetNames]: number }> = artifacts.reduce((buildSetsAcc, artifact: Artifact) => {
-      buildSetsAcc[artifact.set] = buildSetsAcc[artifact.set] ? buildSetsAcc[artifact.set] + 1 : 1;
+      buildSetsAcc[artifact.set] = buildSetsAcc[artifact.set] ? buildSetsAcc[artifact.set] - 1 : 1;
 
       return buildSetsAcc;

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:154:55
     }, {} as Partial<{ [key in SetNames]: number }>);
 
     return Object.keys(buildSets).reduce((buildStats, setName) => {
-      const setWithEffect = this.setsWithEffects.find((setWithEffect) => setWithEffect.name === setName && buildSets[setName] >= 2);
+      const setWithEffect = this.setsWithEffects.find(() => undefined);
       if (setWithEffect) {
         buildStats[setWithEffect.stat] = setWithEffect.value;

[Killed] ConditionalExpression
src/core/usescases/build-optimizer.ts:154:74
     }, {} as Partial<{ [key in SetNames]: number }>);
 
     return Object.keys(buildSets).reduce((buildStats, setName) => {
-      const setWithEffect = this.setsWithEffects.find((setWithEffect) => setWithEffect.name === setName && buildSets[setName] >= 2);
+      const setWithEffect = this.setsWithEffects.find((setWithEffect) => false);
       if (setWithEffect) {
         buildStats[setWithEffect.stat] = setWithEffect.value;

[Killed] BlockStatement
src/core/usescases/build-optimizer.ts:155:26
 
     return Object.keys(buildSets).reduce((buildStats, setName) => {
       const setWithEffect = this.setsWithEffects.find((setWithEffect) => setWithEffect.name === setName && buildSets[setName] >= 2);
-      if (setWithEffect) {
-        buildStats[setWithEffect.stat] = setWithEffect.value;
-      }
+      if (setWithEffect) {}
       return buildStats;
     }, {} as SetStatsValues);

[Timeout] ConditionalExpression
src/core/usescases/build-optimizer.ts:155:11
 
     return Object.keys(buildSets).reduce((buildStats, setName) => {
       const setWithEffect = this.setsWithEffects.find((setWithEffect) => setWithEffect.name === setName && buildSets[setName] >= 2);
-      if (setWithEffect) {
+      if (true) {
         buildStats[setWithEffect.stat] = setWithEffect.value;
       }

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:174:15
       ...characterBonusStat,
       ...artifactsStats,
       ...setsStats,
-    }).filter((statName: ArtifactStatsTypes | PossibleSetStatTypes) => statName.includes('percent'));
+    }).filter(() => undefined);
     const statsUpdatedWithPercent = percentStats.reduce((buildStats, statName: ArtifactStatsTypes | PossibleSetStatTypes) => {
       const buildStatName = this.getBuildStatName(statName);

[Killed] BooleanLiteral
src/core/usescases/build-optimizer.ts:188:64
     }, baseStats);
 
     const otherStats = Object.keys({ ...characterBonusStat, ...artifactsStats, ...setsStats }).filter(
-      (statName: ArtifactStatsTypes | PossibleSetStatTypes) => !percentStats.includes(statName),
+      (statName: ArtifactStatsTypes | PossibleSetStatTypes) => percentStats.includes(statName),
     );
     return otherStats.reduce((buildStats, statName: ArtifactStatsTypes | PossibleSetStatTypes) => {

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:188:7
     }, baseStats);
 
     const otherStats = Object.keys({ ...characterBonusStat, ...artifactsStats, ...setsStats }).filter(
-      (statName: ArtifactStatsTypes | PossibleSetStatTypes) => !percentStats.includes(statName),
+      () => undefined,
     );
     return otherStats.reduce((buildStats, statName: ArtifactStatsTypes | PossibleSetStatTypes) => {

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:209:24
     const getStatValue = (statValue: number) => (isNaN(statValue) ? 0 : statValue);
 
     return statsValues.reduce((acc, statValue) => {
-      acc = Math.round((getStatValue(acc) + getStatValue(statValue)) * 10) / 10;
+      acc = Math.round((getStatValue(acc) + getStatValue(statValue)) / 10) / 10;
       return acc;
     }, 0);

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:209:13
     const getStatValue = (statValue: number) => (isNaN(statValue) ? 0 : statValue);
 
     return statsValues.reduce((acc, statValue) => {
-      acc = Math.round((getStatValue(acc) + getStatValue(statValue)) * 10) / 10;
+      acc = Math.round((getStatValue(acc) + getStatValue(statValue)) * 10) * 10;
       return acc;
     }, 0);

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:215:23
   }
 
   private applyMultiplierToBuildStat(buildStat: number, statValue: number): number {
-    return Math.round(buildStat * (1 + statValue / 100));
+    return Math.round(buildStat / (1 + statValue / 100));
   }
 

[Killed] ArithmeticOperator
src/core/usescases/build-optimizer.ts:215:40
   }
 
   private applyMultiplierToBuildStat(buildStat: number, statValue: number): number {
-    return Math.round(buildStat * (1 + statValue / 100));
+    return Math.round(buildStat * (1 + statValue * 100));
   }
 

[Killed] ArrayDeclaration
src/core/usescases/build-optimizer.ts:220:59
 
   private getBuildStatName(statName: ArtifactStatsTypes | PossibleSetStatTypes): CharacterStatTypes {
     const statNameMap: { buildStatName: PossibleCharacterStats; match: AllBuildStatTypes[] }[] = [
-      { buildStatName: PossibleCharacterStats.atk, match: [possibleBuildStats.flatAtk, possibleBuildStats.percentAtk] },
+      { buildStatName: PossibleCharacterStats.atk, match: [] },
       { buildStatName: PossibleCharacterStats.def, match: [possibleBuildStats.flatDef, possibleBuildStats.percentDef] },
       { buildStatName: PossibleCharacterStats.hp, match: [possibleBuildStats.flatHp, possibleBuildStats.percentHp] },

[Killed] ArrayDeclaration
src/core/usescases/build-optimizer.ts:222:58
     const statNameMap: { buildStatName: PossibleCharacterStats; match: AllBuildStatTypes[] }[] = [
       { buildStatName: PossibleCharacterStats.atk, match: [possibleBuildStats.flatAtk, possibleBuildStats.percentAtk] },
       { buildStatName: PossibleCharacterStats.def, match: [possibleBuildStats.flatDef, possibleBuildStats.percentDef] },
-      { buildStatName: PossibleCharacterStats.hp, match: [possibleBuildStats.flatHp, possibleBuildStats.percentHp] },
+      { buildStatName: PossibleCharacterStats.hp, match: [] },
     ];
 

[Killed] ArrowFunction
src/core/usescases/build-optimizer.ts:225:46
       { buildStatName: PossibleCharacterStats.hp, match: [possibleBuildStats.flatHp, possibleBuildStats.percentHp] },
     ];
 
-    const mappedStateName = statNameMap.find((statNameItem) => statNameItem.match.includes(statName));
+    const mappedStateName = statNameMap.find(() => undefined);
     return mappedStateName ? mappedStateName.buildStatName : (statName as CharacterStatTypes);
   }
